app/views/recommendations/show.html.erb

      <% if @first_user %>
        <% @profile_one = Profile.find_by(user_id: @first_user) %>
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT 1  [["user_id", 2]]