app/views/users/index.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT 1  [["user_id", 1]]
---
<select name="first_match_id">
  <% Profile.all.each do |profile| %>