app/views/received_recommendations/index.html.erb

    <% if @second_user %>
      <% @profile_two = Profile.find_by(user_id: @second_user) %>
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT 1  [["user_id", 5]]