app/controllers/profiles_controller.rb

  def create
    @profile = current_user.create_profile!(profile_params)
---
INSERT INTO "profiles" ("name", "photo_url", "city", "interests", "about_me", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    # @profile = current_user.profile.update(profile_params)
    @profile = current_user.profile.update_attributes(profile_params)
---
UPDATE "profiles" SET "name" = $1, "photo_url" = $2, "interests" = $3, "about_me" = $4 WHERE "profiles"."id" = $5  [["name", "Haleigh"], ["photo_url", "http://www.politestar.com/wp-content/uploads/2015/04/Hayden-Panettiere.jpg"], ["interests", "donuts"], ["about_me", "I love donuts"], ["id", 2]]