app/controllers/recommendations_controller.rb

SELECT "recommendations".* FROM "recommendations" WHERE (user_id = second_match_id)
---
  def index
   @recommendations = Recommendation.all

INSERT INTO "recommendations" ("second_match_id", "first_match_id", "status_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["second_match_id", 8], ["first_match_id", 8], ["status_id", 1], ["user_id", 5]]
---
  def create
    # @recommendation = current_user.recommendations.create(recommendation_params)

    @recommendation = current_user.recommendations.create(:second_match_id => params[:second_match_id], :first_match_id => params[:first_match_id], :status_id => params[:status_id])

SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."user_id" = $1 AND "recommendations"."id" = $2 LIMIT 1  [["user_id", 4], ["id", 1]]
DELETE FROM "recommendations" WHERE "recommendations"."id" = $1  [["id", 1]]
---
  def destroy
    @recommendation = current_user.recommendations.find(params[:id])
    @recommendation.destroy

SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT 1  [["id", 23]]
---
  def accept_first_match
    @recommendation = Recommendation.find(params[:id])

SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT 1  [["id", 14]]
---
  def accept_second_match
    @recommendation = Recommendation.find(params[:id])

SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT 1  [["id", 29]]
DELETE FROM "recommendations" WHERE "recommendations"."id" = $1  [["id", 50]]
---
  def decline
    @recommendation = Recommendation.find(params[:id])
    if @recommendation.destroy