app/controllers/users_controller.rb

  def show
    @recommendations = Recommendation.all
---
SELECT "recommendations".* FROM "recommendations" WHERE "recommendations"."user_id" = $1  [["user_id", 4]]